Revit 2024 API
ParameterTypeId.FamilyWorkPlaneBased Property
 "Work Plane-Based"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FamilyWorkPlaneBased { get; }
Visual Basic
Public Shared ReadOnly Property FamilyWorkPlaneBased As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FamilyWorkPlaneBased {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace